package survive.main;




public class charactor {
	public static void main(String[]args) {
	
/* 스텟	
힘
지구력
민첩
지능
체력
*/		

/* 컨디션
 질병으로 인한 컨디션
 기본 컨디션
 날씨 컨디션
 
 */
		
/* 음식
포만감
체수분
 */
		
/*시간
 기본 시간
 휴식 시간
 취침 시간
 작업 시간
 이동시간
 밤낮 - 밤에는 좀비 나올 확률이 증가됨. 
 */
		
/* 전투
   평타 -> 회피 => 강타 -> 방어 => 평타 순서로 베네핏을 가짐 = 으로 표현된 부분에서는 카운터 발생의 확률이 존재함.  
   상황
   발견(지능) - 은신(지능) - 도주(민첩) - 전투(복합)의 상황으로 나뉨.
 */
		
/* 몬스터
 들개
 맷돼지
 생존자
 좀비
 */
		
/* 노동
  벌목 - 가공 - 목재
  채광 - 가공 - 금속
  진흙 - 가공 - 점토
  채집 - 가공 - 음식
  강물 - 가공 - 식수 
 */
		
/* 수첩? 시간남으면
  
 */
		
	//문서의끝
	}
}
