package private_work;

public class game_01 {

	public static void main(String[] args) {

	}

}
/*
□ □ □ □ □ □ □ □ □ ★
□ □ □ □ □ □ □ □ □ □
□ □ □ □ □ □ □ □ □ □
□ □ □ □ □ □ □ □ □ □
□ □ □ □ □ □ □ □ □ □
□ □ □ □ □ □ □ □ □ □
□ □ □ □ □ □ □ □ □ □
□ □ □ □ □ □ □ □ □ □
□ □ □ □ □ □ □ □ □ □
● □ □ □ □ □ □ □ □ □

동그라미를 움직여서 	별표까지 도달하는 것.


방향키는 ASDW / 
그 외에 값을 입력하면 default 활용해서 "올바른 방향을 입력해 주십시오" 라고 출력
스캔 한번 받고 끝이 아니라 입력값이 들어오는대로 계속 콘솔창에 출력해주는 기능이 있는가
이전 값은 다시 빈칸으로 돌리고 현재 칸만 돌리면 rpg
이전 값도 그대로 유지하면 뱀게임이 됨
동그라미의 값이 별표값과 일치하게 되면 승리 메시지 띄우고 루프 종료


*/